t1 = (28, 67, 21, 67, 11)
t2 = ('北京', '1111', '你好')
t3 = (100, True, '你好', None)
t4 = (100, True, '你好', None, (50, 60, 70))

# 通过下标取值
print(t1[3])  # 67
print(t1[-1])  # 11

# 定义空元祖
t5 = ()
t6 = tuple()

# 定义只有一个元素的元祖
t7 = (1,)
t8 = ('python',)


# 返回元组中的最大值。
t1 = (23, 11, 32, 30, 17)
res = max(t1)
print(res)  # 32

# 统计元组中所有元素的和（元素必须是数字）。
t1 = (23, 11, 32, 30, 17)
res = sum(t1)
print(res)  # 113

# 返回元组中的最小值。
t1 = (23, 11, 32, 30, 17)
res = min(t1)
print(res)  # 11

# 返回元组中元素的个数（元组长度）。
t1 = (23, 11, 32, 30, 17)
res = len(t1)
print(res)  # 5

# 对元组进行排序（不修改原元组，返回一个新的列表）。
t1 = (23, 11, 32, 30, 17)
res = sorted(t1)
print(tuple(res))  # (11, 17, 23, 30, 32)