print('====================可变集合的定义=================')
s1 = {10, 20, 20, 30, 40, 40, 50, 60, 60, 70, 80, 90, 100}
# 去重后：{10, 20, 30, 40, 50, 60, 70, 80, 90, 100}
print('可变集合-数字集合', s1)

s2 = {'你好', 'hello', '你好', 'atguigu', '北京'}
# 去重后：{'你好', 'hello', 'atguigu', '北京'}
print('可变集合-字符串集合', s2)

s3 = {10, '你好', 1, True, 12.4}
# 注意：1 和 True 在集合中会被视为重复元素（因为 1 == True），去重后可能为 {10, '你好', 1, 12.4}
print('可变集合-混合类型', s3)


print('\n\n====================不可变集合的定义=================')
print('====================frozenset接收的是任意可迭代对象，但是最终返回的一定是【不可变集合】 =================')
s4 = frozenset({10, 20, 20, 30, 40, 40, 50, 60, 60, 70, 80, 90, 100})
# 去重后：{10, 20, 30, 40, 50, 60, 70, 80, 90, 100}
print('不可变集合-数字集合', s4)
s5 = frozenset({'你好', 'hello', '你好', 'atguigu', '北京'})
# 去重后：{'你好', 'hello', 'atguigu', '北京'}
print('不可变集合-字符串集合', s5)
s6 = frozenset({10, '你好', 1, True, 12.4})
# 注意：1 和 True 在集合中会被视为重复元素（因为 1 == True），去重后可能为 {10, '你好', 1, 12.4}
print('不可变集合-混合类型', s6)

print('\n\n====================可变空集合的定义=================')
s7 = set()
print('可变空集合定义', s7)

print('\n\n====================不可空集合的定义=================')
s8 = frozenset()
print('不可变空集合定义', s8)

print('\n\n====================集合的嵌套规则=================')
# 定义可变集合
s9 = {10, 20, 30, 40, 50}
# 定义不可变集合（frozenset）
s10 = frozenset({100, 200, 300, 400, 500})
# 定义列表（可变类型）
s11 = [666, 777, 888]
# 定义元组（不可变类型）
s12 = ('hello', 'atguigu', '北京')
# ❌ 报错
# s12 = {11, 22, 33, s9}
# ✅ 正确
s14 = {11, 22, 33, s10}
# ❌ 报错
# s15 = {11, 22, 33, s11}
# ✅ 正确
s16 = {11, 22, 33, s12}
print(s14, '正确✅', s16)

print('\n\n====================集合的增删改查操作=================')

print('\n\n====================集合的常用方法=================')

print('\n\n====================集合的数学运算=================')

print('\n\n====================集合的循环遍历=================')
